import libraies

In [206]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

Series 约等于 indexed dictionary

In [207]:
dict_ex = {"a": 1, "b": 2, "c": 3}
series = Series(dict_ex)
series
# dtype: int64

a    1
b    2
c    3
dtype: int64

In [208]:
new_index = ["a", "b", "c", "d"]
series_new = Series(dict_ex, index=new_index)
series_new
# dtype: float64, b/c NaN is considered as float

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [209]:
series_new[1:3]

b    2.0
c    3.0
dtype: float64

In [210]:
series1 = Series(["a", "b", "c", "d"])
series1

# del will modify the original Series
# drop will return a new object. The original series won't be changed . (Unless inplace=true)

0    a
1    b
2    c
3    d
dtype: object

DataFrame is table like

Can be row-indexed and column-indexed

In [211]:
data = {
    "name": ["john", "jose", "dan", "jane"],
    "score": [80, 43, 90, 100],
    "course": ["math", "math", "english", "english"],
}
frame = DataFrame(data)
frame

   name  score   course
0  john     80     math
1  jose     43     math
2   dan     90  english
3  jane    100  english

In [212]:
frame.values

array([['john', 80, 'math'],
       ['jose', 43, 'math'],
       ['dan', 90, 'english'],
       ['jane', 100, 'english']], dtype=object)

In [213]:
frame.shape

(4, 3)

In [214]:
frame.index

RangeIndex(start=0, stop=4, step=1)

In [215]:
s0 = Series([234, 235, 435])
s1 = Series([1, 0, 0])
frame1 = DataFrame({"column0": s0, "column1": s1})
frame1

   column0  column1
0      234        1
1      235        0
2      435        0

In [216]:
# loc: params are names
# iloc: params are indexes

# drop will delete rows (axis default = 0)
# axis = 1 will delete columns
# pop will delete columns, cannot delete rows


def multiple_by_2(score: int) -> bool:
    return score * 2


s: Series = frame["score"].apply(multiple_by_2)
# this is so much faster than loops.
# this is done in parallel
s

0    160
1     86
2    180
3    200
Name: score, dtype: int64

Pandas:

- I/O
- Groupby
- Merge and concat
- Missing value and Outlier Data

In [217]:
file_path = "./data/example.csv"
df = pd.read_csv(file_path, sep=",", header=0)
print(df.shape, df.dtypes)

df[:5].to_csv("./data/sliced.csv", index=False)

(14, 2) name      object
score    float64
dtype: object

In [218]:
df.head(3)

  name  score
0    a  100.0
1    b   33.0
2    c   89.0

In [219]:
df.tail(4)

   name  score
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [220]:
df.describe()

            score
count   12.000000
mean    95.000000
std    136.833675
min    -77.000000
25%     42.250000
50%     79.500000
75%     99.250000
max    500.000000

In [221]:
df.sort_values(by="score", ascending=False)

   name  score
12    b  500.0
8     i  101.0
0     a  100.0
9     j   99.0
11    a   90.0
2     c   89.0
10    k   70.0
4     e   56.0
5     f   45.0
6     g   34.0
1     b   33.0
13    c  -77.0
3     d    NaN
7     h    NaN

In [222]:
df[(df["score"] > 60) & (df["score"] < 95)]

   name  score
2     c   89.0
10    k   70.0
11    a   90.0

Groupby

- Splitting the data into groups based on some criteria
- Applying a funciotn to each group indenpendently
- Combining the results into a data structure

In [223]:
grouped = df.groupby(["name"])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [224]:
grouped.size()

name
a    2
b    2
c    2
d    1
e    1
f    1
g    1
h    1
i    1
j    1
k    1
dtype: int64

In [225]:
grouped["score"].mean().head(5)

name
a     95.0
b    266.5
c      6.0
d      NaN
e     56.0
Name: score, dtype: float64

In [226]:
# merge

slice = pd.read_csv("./data/sliced.csv")
df3 = pd.merge(df, slice, on="name", how="inner")
df3

  name  score_x  score_y
0    a    100.0    100.0
1    b     33.0     33.0
2    c     89.0     89.0
3    d      NaN      NaN
4    e     56.0     56.0
5    a     90.0    100.0
6    b    500.0     33.0
7    c    -77.0     89.0

In [227]:
# concat

pd.concat([df[:4], df[7:]])

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
3     d    NaN
7     h    NaN
8     i  101.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [228]:
df.dropna()

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
4     e   56.0
5     f   45.0
6     g   34.0
8     i  101.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [229]:
df.fillna(0)

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
3     d    0.0
4     e   56.0
5     f   45.0
6     g   34.0
7     h    0.0
8     i  101.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [230]:
df.ffill()

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
3     d   89.0
4     e   56.0
5     f   45.0
6     g   34.0
7     h   34.0
8     i  101.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [231]:
df.fillna(df["score"].mean())

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
3     d   95.0
4     e   56.0
5     f   45.0
6     g   34.0
7     h   95.0
8     i  101.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  500.0
13    c  -77.0

In [232]:
max = 100
min = 0
df["score"] = df["score"].clip(min, max)
df

   name  score
0     a  100.0
1     b   33.0
2     c   89.0
3     d    NaN
4     e   56.0
5     f   45.0
6     g   34.0
7     h    NaN
8     i  100.0
9     j   99.0
10    k   70.0
11    a   90.0
12    b  100.0
13    c    0.0

In [233]:
df = pd.read_csv(file_path)
des = df["score"].describe()
des

count     12.000000
mean      95.000000
std      136.833675
min      -77.000000
25%       42.250000
50%       79.500000
75%       99.250000
max      500.000000
Name: score, dtype: float64

In [234]:
max = des["mean"] + 2 * des["std"]
min = des["mean"] - 2 * des["std"]
df["score"] = df["score"].clip(min, max)
df

   name       score
0     a  100.000000
1     b   33.000000
2     c   89.000000
3     d         NaN
4     e   56.000000
5     f   45.000000
6     g   34.000000
7     h         NaN
8     i  101.000000
9     j   99.000000
10    k   70.000000
11    a   90.000000
12    b  368.667349
13    c  -77.000000